spec/fixtures/cassettes/create_invoice.yml

---
http_interactions:
- request:
    method: post
    uri: https://api-sandbox.nowpayments.io/v1/invoice
    body:
      encoding: UTF-8
      string: '{"price_amount":50.0,"price_currency":"usd","order_id":"inv-1761964962"}'
    headers:
      X-Api-Key:
      - test_key
      User-Agent:
      - Faraday v2.14.0
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 403
      message: Forbidden
    headers:
      Date:
      - Sat, 01 Nov 2025 02:42:43 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Server:
      - cloudflare
      X-Dns-Prefetch-Control:
      - 'off'
      X-Frame-Options:
      - SAMEORIGIN
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      - max-age=15768000
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Vary:
      - Origin, Accept-Encoding
      Cf-Cache-Status:
      - DYNAMIC
      Nel:
      - '{"report_to":"cf-nel","success_fraction":0.0,"max_age":604800}'
      Report-To:
      - '{"group":"cf-nel","max_age":604800,"endpoints":[{"url":"https://a.nel.cloudflare.com/report/v4?s=khcsn28IPL8ZfbfKre7XfJWc45hopk4WZedUIDEUpz2oa4y308O2ONVB0BCh1If45wFx83aORXP%2FFoexRnsJHElifrBDQQrFkMEn82gTzz48dB103wQf"}]}'
      Cf-Ray:
      - 99780a5aef7a2def-SYD
    body:
      encoding: ASCII-8BIT
      string: '{"status":false,"statusCode":403,"code":"INVALID_API_KEY","message":"Invalid
        api key"}'
  recorded_at: Sat, 01 Nov 2025 02:42:43 GMT
recorded_with: VCR 6.3.1
