spec/fixtures/cassettes/create_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api-sandbox.nowpayments.io/v1/payment
    body:
      encoding: UTF-8
      string: '{"price_amount":100.0,"price_currency":"usd","pay_currency":"btc","order_id":"test-1761964961"}'
    headers:
      X-Api-Key:
      - test_key
      User-Agent:
      - Faraday v2.14.0
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 403
      message: Forbidden
    headers:
      Date:
      - Sat, 01 Nov 2025 02:42:42 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Server:
      - cloudflare
      X-Dns-Prefetch-Control:
      - 'off'
      X-Frame-Options:
      - SAMEORIGIN
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      - max-age=15768000
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Vary:
      - Origin, Accept-Encoding
      Cf-Cache-Status:
      - DYNAMIC
      Nel:
      - '{"report_to":"cf-nel","success_fraction":0.0,"max_age":604800}'
      Report-To:
      - '{"group":"cf-nel","max_age":604800,"endpoints":[{"url":"https://a.nel.cloudflare.com/report/v4?s=ndfP1NwHOBxL3GURQ6p3gIuP0sKOhusdfscO63UIeLArPYROmQzc14McEOtu%2B2jxSUGv4hTiw0QoQVU5LE4Ye3XIhnqWCnNq4NBYz%2Fw0gnXlQW3dOnS%2BKSY%3D"}]}'
      Cf-Ray:
      - 99780a544cffa801-SYD
    body:
      encoding: ASCII-8BIT
      string: '{"status":false,"statusCode":403,"code":"INVALID_API_KEY","message":"Invalid
        api key"}'
  recorded_at: Sat, 01 Nov 2025 02:42:42 GMT
recorded_with: VCR 6.3.1
