spec/fixtures/cassettes/estimate_price.yml

---
http_interactions:
- request:
    method: get
    uri: https://api-sandbox.nowpayments.io/v1/estimate?amount=100&currency_from=usd&currency_to=btc
    body:
      encoding: US-ASCII
      string: ''
    headers:
      X-Api-Key:
      - test_key
      User-Agent:
      - Faraday v2.14.0
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 403
      message: Forbidden
    headers:
      Date:
      - Sat, 01 Nov 2025 02:42:41 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Server:
      - cloudflare
      X-Dns-Prefetch-Control:
      - 'off'
      X-Frame-Options:
      - SAMEORIGIN
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      - max-age=15768000
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Vary:
      - Origin, Accept-Encoding
      Cf-Cache-Status:
      - DYNAMIC
      Nel:
      - '{"report_to":"cf-nel","success_fraction":0.0,"max_age":604800}'
      Report-To:
      - '{"group":"cf-nel","max_age":604800,"endpoints":[{"url":"https://a.nel.cloudflare.com/report/v4?s=CZWjhgdGqbtCTsHXqgThT5ej%2B%2F7nNvXStkHCcPYzMpZ1bEaDG92GYIpdzAfW146y%2BklI3AU4357WFAkl014HcSHHbBAGK132Z1lxGOxG4Mw6WEdkuQ33YXQ%3D"}]}'
      Cf-Ray:
      - 99780a4e695e358b-SYD
    body:
      encoding: ASCII-8BIT
      string: '{"status":false,"statusCode":403,"code":"INVALID_API_KEY","message":"Invalid
        api key"}'
  recorded_at: Sat, 01 Nov 2025 02:42:41 GMT
recorded_with: VCR 6.3.1
