spec/fixtures/cassettes/get_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api-sandbox.nowpayments.io/v1/payment
    body:
      encoding: UTF-8
      string: '{"price_amount":100.0,"price_currency":"usd","pay_currency":"btc","order_id":"test-status-1761964962"}'
    headers:
      X-Api-Key:
      - test_key
      User-Agent:
      - Faraday v2.14.0
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 403
      message: Forbidden
    headers:
      Date:
      - Sat, 01 Nov 2025 02:42:42 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Server:
      - cloudflare
      X-Dns-Prefetch-Control:
      - 'off'
      X-Frame-Options:
      - SAMEORIGIN
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      - max-age=15768000
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Vary:
      - Origin, Accept-Encoding
      Cf-Cache-Status:
      - DYNAMIC
      Nel:
      - '{"report_to":"cf-nel","success_fraction":0.0,"max_age":604800}'
      Report-To:
      - '{"group":"cf-nel","max_age":604800,"endpoints":[{"url":"https://a.nel.cloudflare.com/report/v4?s=633ypJ4txHnDs0vDJ3kvlNZW9UIEarqX2%2BoWEV8q2pMF%2Fu6K9uFM92Dn7naF8HaajGzXQsJ1q6EFCqvKrBmtxSglkuG499HHj8OjJx9PnOLuIOaDcI8Av6Y%3D"}]}'
      Cf-Ray:
      - 99780a5688eae7c4-SYD
    body:
      encoding: ASCII-8BIT
      string: '{"status":false,"statusCode":403,"code":"INVALID_API_KEY","message":"Invalid
        api key"}'
  recorded_at: Sat, 01 Nov 2025 02:42:42 GMT
- request:
    method: get
    uri: https://api-sandbox.nowpayments.io/v1/payment/
    body:
      encoding: US-ASCII
      string: ''
    headers:
      X-Api-Key:
      - test_key
      User-Agent:
      - Faraday v2.14.0
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Date:
      - Sat, 01 Nov 2025 02:42:42 GMT
      Content-Type:
      - application/json; charset=utf-8
      Content-Length:
      - '128'
      Connection:
      - keep-alive
      Server:
      - cloudflare
      X-Dns-Prefetch-Control:
      - 'off'
      X-Frame-Options:
      - SAMEORIGIN
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      - max-age=15768000
      X-Download-Options:
      - noopen
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Vary:
      - Origin, Accept-Encoding
      Cf-Cache-Status:
      - DYNAMIC
      Nel:
      - '{"report_to":"cf-nel","success_fraction":0.0,"max_age":604800}'
      Report-To:
      - '{"group":"cf-nel","max_age":604800,"endpoints":[{"url":"https://a.nel.cloudflare.com/report/v4?s=97o918%2Ba8lxW0m4jLqJUSW6UM3e%2BzLp5rvpzmeKW4eBiLcRHfVFs2IPW3V9htOo8%2BQ0jYTtUzuntwIs3MJqotJ9yefHqpy7O2Z7XiJp879DY6ZYdV%2FuL"}]}'
      Cf-Ray:
      - 99780a58abff5bf4-SYD
    body:
      encoding: UTF-8
      string: '{"status":false,"statusCode":401,"code":"AUTH_REQUIRED","message":"Authorization
        header is empty (Bearer JWTtoken is required)"}'
  recorded_at: Sat, 01 Nov 2025 02:42:42 GMT
recorded_with: VCR 6.3.1
